InformationRegisters/УсловияРегламентныхРаботВТТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>УсловияРегламентныхРаботВТТ</Name>
			<Comment>Условия регл. работ в магазинах</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдинаяСтоимостьУслугиПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧислоОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозможностьОплатыДоНачала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыСтруктурныхЕдиниц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыСтруктурныхЕдиниц</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Розница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Склад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Офис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СторонняяРозница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкладСтороннейРозницы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыРозничныхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыРозничныхТочек</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Избенка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Магазин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перекресток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Микромаркет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пятерочка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПространствоВкуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вкусомат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тилси</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркетПлейс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/УсловияРегламентныхРаботВТТ/Forms/ФормаЗаписиСтарая/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьСписокПериодичностей()
	
	мПериодичность = Перечисления.Периодичность;
	
	СписокПериодичностей = Новый СписокЗначений;
	СписокПериодичностей.Добавить(мПериодичность.День);
	СписокПериодичностей.Добавить(мПериодичность.Неделя);
	СписокПериодичностей.Добавить(мПериодичность.Месяц);
	СписокПериодичностей.Добавить(мПериодичность.Год);
	
	Возврат СписокПериодичностей;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Запись.Периодичность.Пустая() Тогда
		Запись.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Запись.ДатаНачала) Тогда
		Если Запись.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя") Тогда
			Запись.ДатаНачала = НачалоНедели(ТекущаяДата());
		ИначеЕсли Запись.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
			Запись.ДатаНачала = НачалоМесяца(ТекущаяДата());
		ИначеЕсли Запись.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
			Запись.ДатаНачала = НачалоГода(ТекущаяДата());
		Иначе
			Запись.ДатаНачала = ТекущаяДата();
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Запись.ДатаОкончания) Тогда
		Если Запись.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя") Тогда
			Запись.ДатаОкончания = КонецНедели(Запись.ДатаНачала);
		ИначеЕсли Запись.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
			Запись.ДатаОкончания = НачалоМесяца(Запись.ДатаНачала);
		ИначеЕсли Запись.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
			Запись.ДатаОкончания = НачалоГода(Запись.ДатаНачала);
		Иначе
			Запись.ДатаОкончания = ТекущаяДата();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = ПолучитьФорму("Справочник.Контрагенты.ФормаВыбора",, Элемент);
	ФормаВыбора.НачальноеЗначениеВыбора = Запись.Контрагент;
	
	ФормаВыбора.Отбор.ОказываетРегламентныеУслуги.Установить(Истина);
	
	ФормаВыбора.Открыть();
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура УслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = ПолучитьФорму("Справочник.Номенклатура.ФормаВыбора",, Элемент);
	ФормаВыбора.НачальноеЗначениеВыбора = Запись.Услуга;
	
	ФормаВыбора.Отбор.ВидНоменклатуры.Установить(Перечисления.ВидыНоменклатуры.Услуга);
	ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ВидНоменклатуры.Доступность = Ложь;
	
	ФормаВыбора.Открыть();
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ТорговаяТочкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = ПолучитьФорму("Справочник.СтруктурныеЕдиницы.ФормаВыбора",, Элемент);
	ФормаВыбора.НачальноеЗначениеВыбора = Запись.ТорговаяТочка;
	
	ФормаВыбора.Отбор.Активное.Установить(Истина);
	
	ФормаВыбора.Отбор.ТипСтруктурнойЕдиницы.Установить(Перечисления.ТипыСтруктурныхЕдиниц.Розница);
	ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ТипСтруктурнойЕдиницы.Доступность = Ложь;
	
	ФормаВыбора.Отбор.ТипРозничнойТочки.Установить(Перечисления.ТипыРозничныхТочек.Магазин);
	ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ТипРозничнойТочки.Доступность = Ложь;
	
	ФормаВыбора.Открыть();
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.ДатаНачала) Тогда
		Если Запись.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя")
				 И НЕ Запись.ДатаНачала = НачалоНедели(Запись.ДатаНачала) Тогда
			Запись.ДатаНачала = НачалоНедели(Запись.ДатаНачала);
		ИначеЕсли Запись.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц")
				 И НЕ Запись.ДатаНачала = НачалоМесяца(Запись.ДатаНачала) Тогда
			Запись.ДатаНачала = НачалоМесяца(Запись.ДатаНачала);
		ИначеЕсли Запись.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год")
				 И НЕ Запись.ДатаНачала = НачалоГода(Запись.ДатаНачала) Тогда
			Запись.ДатаНачала = НачалоГода(Запись.ДатаНачала);
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Запись.ДатаОкончания) Тогда
		Если Запись.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя")
				 И НЕ Запись.ДатаОкончания = КонецНедели(Запись.ДатаНачала) Тогда
			Запись.ДатаОкончания = КонецНедели(Запись.ДатаНачала);
		ИначеЕсли Запись.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц")
				 И НЕ Запись.ДатаОкончания = КонецМесяца(Запись.ДатаНачала) Тогда
			Запись.ДатаОкончания = КонецМесяца(Запись.ДатаНачала);
		ИначеЕсли Запись.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год")
				 И НЕ Запись.ДатаОкончания = КонецГода(Запись.ДатаНачала) Тогда
			Запись.ДатаОкончания = КонецГода(Запись.ДатаНачала);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	СписокПериодичностей = ПолучитьСписокПериодичностей();
	ВыбранныйЭлемент = ВыбратьИзСписка(СписокПериодичностей, Элемент, СписокПериодичностей.НайтиПоЗначению(Запись.Периодичность));
	Если НЕ ВыбранныйЭлемент = Неопределено Тогда
		Запись.Периодичность = ВыбранныйЭлемент.Значение;
		ПериодичностьПриИзменении(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.ДатаНачала) Тогда
		Если Запись.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя")
				 И НЕ Запись.ДатаНачала = НачалоНедели(Запись.ДатаНачала) Тогда
			Запись.ДатаНачала = НачалоНедели(Запись.ДатаНачала);
		ИначеЕсли Запись.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц")
				 И НЕ Запись.ДатаНачала = НачалоМесяца(Запись.ДатаНачала) Тогда
			Запись.ДатаНачала = НачалоМесяца(Запись.ДатаНачала);
		ИначеЕсли Запись.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год")
				 И НЕ Запись.ДатаНачала = НачалоГода(Запись.ДатаНачала) Тогда
			Запись.ДатаНачала = НачалоГода(Запись.ДатаНачала);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.ДатаОкончания) Тогда
		Если Запись.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя")
				 И НЕ Запись.ДатаОкончания = КонецНедели(Запись.ДатаНачала) Тогда
			Запись.ДатаОкончания = КонецНедели(Запись.ДатаНачала);
		ИначеЕсли Запись.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц")
				 И НЕ Запись.ДатаОкончания = КонецМесяца(Запись.ДатаНачала) Тогда
			Запись.ДатаОкончания = КонецМесяца(Запись.ДатаНачала);
		ИначеЕсли Запись.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год")
				 И НЕ Запись.ДатаОкончания = КонецГода(Запись.ДатаНачала) Тогда
			Запись.ДатаОкончания = КонецГода(Запись.ДатаНачала);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
